applications/solvers/dbs_reactiveThermalFoam/runs/differentTimeSteps/timeCoeff_1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

// startFrom       startTime;
startFrom       latestTime;
startTime       0;

stopAt          endTime;

// endTime         5;

// endTime         0.1;
// // endTime         20;

// deltaT          1e-5;

// //writeControl    adjustableRunTime;
// writeControl    adjustableRunTime;

// // writeInterval   1;
// writeInterval   0.01;

endTime        2e-3;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   1e-3;


purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

adjustTimeStep  yes;
// adjustTimeStep  off;

maxCo           0.90;

maxDeltaT       0.001;

// functions
// {
//     #includeFunc  residuals
//     #includeFunc  minMaxComponents
// }

// ************************************************************************* //
